Repository: Emil-18/enhanced-control-support
Catalog: addon/locale/*/LC_MESSAGES/nvda.po
Languages: nb_no

source: Press
nb_no: Trykk

source: Use normal add-on behavior
nb_no: Bruk normal tillegg oppførsell

source: Use normal NVDA behavior
nb_no: Bruk normal NVDA oppførsell

source: Select control type
nb_no: Velg kontroll type:

source: unlabeled
nb_no: umerket

source: Select a control type. NVDA will behave as if
nb_no: Velg en kontroll type. NVDA vil oppføre seg som om

source: and all similar controls in the same program are the control type you selected, for example, if you select button, all similar controls will be treated as buttons
nb_no: og alle lignende kontroller i det samme programmet er kontrolltypen du valgte, for eksempel, viss du velger knapp, vil alle lignende kontroller bli behandlet som knapper

source: Control type:
nb_no: Kontroll type:

source: rely on events. Only change if you know what you are doing
nb_no: Stol på hendelser. Bare forandre viss du vet hva du gjør

source: Temporarily use normal add-on behavior for all controls
nb_no: Midlertidig bruk vanlig tillegg oppførsel for alle kontroller

source: Lets you choose from a list of controls how NVDA will treat the control with focus. For example, choos 'button' To tell NVDA to treat it as a button.
nb_no: Lar deg velge fra en liste med kontroller hvordan NVDA vil behandle kontrollen med fokus, for eksempel, velg 'knapp' for og fortelle NVDA til og behandle den som en knapp

source: You can not assign another control type to this object, because it has no assosiation with a control in Windows
nb_no: Du kan ikke tilordne en annen kontrolltype til dette objektet, fordi det ikke har noen assosiasjon med en kontroll i Windows

source: You can not assign another control type to any object contained within NVDA, because if done wrong, you may not be able to reverse the changes you have made
nb_no: Du kan ikke tilordne en annen kontrolltype til noe objekt i NVDA, fordi hvis du gjør feil, kan det hende du ikke kan reversere endringene du har gjort

source: Lets you choose from a list of controls how NVDA will treat the control where the navigator object is located. For example, choos 'button' To tell NVDA to treat it as a button.
nb_no: Lar deg velge fra en liste over kontroller hvordan NVDA vil behandle kontrollen der navigatorobjektet befinner seg. For eksempel, velg 'knapp' For å fortelle NVDA å behandle den som en knapp.

source: Tries to find out an report the type of the control with focus. If pressed twice, information about the control where the navigator object is located will be reported instead
nb_no: Prøver og finne ut av og rapportere hvilken kontroll type kontrollen med fokus har. Hvis trykkket to ganger, vil informasjon om navigasjonsobjektet bli rapportert i stedet

source: Unable to find control type
nb_no: Kan ikke finne kontroll type

source: Enhanced Control Support
nb_no: Forbedret kontroll støtte

source: Adds support for more controls in NVDA.
nb_no: Legger til støtte for flere kontroller i NVDA.
